#+TITLE: SICP
#+AUTHOR: Shi-Chao Xia
#+EMAIL: shichaoxia@outlook.com

#+OPTIONS: toc:t tex:verbatim
#+STARTUP: overview nohideblocks latexpreview noinlineimages
#+PROPERTY: header-args :eval no-export :noweb no-export :results output

#+begin_comment
Set tex to verbatim to preserve the math when exporting texinfo.

The fourth level header link can't be handled correctly by makeinfo, so replace it with a internal dedicated target link.
#+end_comment

This article was written using Emacs in Org mode, then exported to Texinfo format, and finally to HTML.

Here are some useful links:

- [[https://shichaoxia.github.io/sicp-2e/][Structure and Interpretation of Computer Programs 2nd edition]]
- [[http://community.schemewiki.org/?SICP-Solutions][SICP-Solutions]]
- [[https://mitpress.mit.edu/sites/default/files/sicp/code/index.html][Complete Code from SICP Second Edition]]
- [[http://www.composingprograms.com][Composing Programs]]

**** Exercise 1.34
     <<Exercise 1.34>>
     #+PINDEX: 1.34
     Suppose we define the procedure
     #+CAPTION: exercise-1-34-q
     #+NAME: exercise-1-34-q
     #+begin_src scheme
       (define (f g) (g 2))
     #+end_src
     Then we have
     #+begin_src scheme
       (f square)
       4

       (f (lambda (z) (* z (+ z 1))))
       6
     #+end_src
     What happens if we (perversely) ask the interpreter to evaluate the combination ~(f f)~? Explain.

     *Solution*

     #+header: :exports both
     #+begin_src scheme
       <<common>>
       <<exercise-1-34-q>>
       (f f) ; finally (2 2)
     #+end_src

     #+RESULTS:
     : ice-9/boot-9.scm:1669:16: In procedure raise-exception:
     : Wrong type to apply: 2
     :
     : Entering a new prompt.  Type `,bt' for a backtrace or `,q' to continue.
     : scheme@(guile-user) [1]>

**** Exercise 1.36
     <<Exercise 1.36>>
     #+PINDEX: 1.36 with/without average damping
     Modify ~fixed-point~ so that it prints the sequence of approximations it generates, using the newline and display primitives shown in [[Exercise 1.22]]. Then find a solution to \( x^x=1000 \) by finding a fixed point of \( x \mapsto \log(1000)/\log(x) \). (Use Scheme’s primitive ~log~ procedure, which computes natural logarithms.) Compare the number of steps this takes with and without average damping. (Note that you cannot start ~fixed-point~ with a guess of 1, as this would cause division by \( \log(1)=0 \).)

     *Solution*

     #+CAPTION: exercise-1-36-fpp
     #+NAME: exercise-1-36-fpp
     #+begin_src scheme
       (define count 1)
       (define (fixed-point f guess)
         (let ((next-guess (f guess)))
           (newline) (display count)
           (display ": ")(display next-guess)
           (if (< (abs (- next-guess guess)) 0.0001)
               next-guess
               (begin (set! count (+ 1 count))
                      (fixed-point f next-guess)))))
     #+end_src

     #+header: :exports both
     #+begin_src scheme
       <<common>>
       <<exercise-1-36-fpp>>
       (p "without average damping")
       (fixed-point (lambda (x)
                      (/ (log 1000) (log x)))
                    2)
       (p "")
       (p "with average damping")
       (set! count 1)
       (fixed-point (lambda (x)
                      (/ (+ x (/ (log 1000) (log x))) 2))
                    2)

     #+end_src

     #+RESULTS:
     #+begin_example

     without average damping
     1: 9.965784284662087
     2: 3.004472209841214
     3: 6.279195757507157
     4: 3.759850702401539
     5: 5.215843784925895
     6: 4.182207192401397
     7: 4.8277650983445906
     8: 4.387593384662677
     9: 4.671250085763899
     10: 4.481403616895052
     11: 4.6053657460929
     12: 4.5230849678718865
     13: 4.577114682047341
     14: 4.541382480151454
     15: 4.564903245230833
     16: 4.549372679303342
     17: 4.559606491913287
     18: 4.552853875788271
     19: 4.557305529748263
     20: 4.554369064436181
     21: 4.556305311532999
     22: 4.555028263573554
     23: 4.555870396702851
     24: 4.555315001192079
     25: 4.5556812635433275
     26: 4.555439715736846
     27: 4.555599009998291
     28: 4.555493957531389
     29: 4.555563237292884

     with average damping
     1: 5.9828921423310435
     2: 4.922168721308343
     3: 4.628224318195455
     4: 4.568346513136242
     5: 4.5577305909237005
     6: 4.555909809045131
     7: 4.555599411610624
     8: 4.5555465521473675
     #+end_example

**** Exercise 1.37
     <<Exercise 1.37>>
     #+PINDEX: 1.37 continued fraction
     1. An infinite /continued fraction/ is an expression of the form
        \[ f=\large\frac{N_1}{D_1+\frac{N_2}{D_2+\frac{N_3}{D_3+\cdots}}} \]
        As an example, one can show that the infinite continued fraction expansion with the \( N_i \) and the \( D_i \) all equal to 1 produces \( 1/\varphi \), where \( \varphi \) is the golden ratio (described in [[*Tree Recursion]]). One way to approximate an infinite continued fraction is to truncate the expansion after a given number of terms. Such a truncation—a so-called finite continued fraction /k-term finite continued fraction/ —has the form
        \[ \large\frac{N_1}{D_1+\frac{N_2}{\ddots+\frac{N_k}{D_k}}} \]
        Suppose that n and d are procedures of one argument (the term index i) that return the Ni and Di of the terms of the continued fraction. Define a procedure cont-frac such that evaluating (cont-frac n d k) computes the value of the k-term finite continued fraction. Check your procedure by approximating \( 1/\varphi \) using
        #+begin_src scheme
          (cont-frac (lambda (i) 1.0)
                     (lambda (i) 1.0)
                     k)
        #+end_src
        for successive values of k. How large must you make k in order to get an approximation that is accurate to 4 decimal places?
     2. If your cont-frac procedure generates a recursive process, write one that generates an iterative process. If it generates an iterative process, write one that generates a recursive process.


     *Solution*

     The first three fractions:

     \begin{equation*}
       \frac{N_1}{D_1},
       \frac{N_1}{D_1+\frac{N_2}{D_2}},
       \frac{N_1}{D_1+\frac{N_2}{D_2+\frac{N_3}{D_3}}.
     \end{equation*}

     #+CAPTION: exercise-1-37-recur
     #+NAME: exercise-1-37-recur
     #+begin_src scheme
       (define (cont-frac n d k)
         (define (recur i)
           (/ (n i)
              (+ (d i)
                 (if (= i k)
                     0
                     (recur (+ i 1))))))
         (recur 1))
     #+end_src

     #+CAPTION: exercise-1-37-iter
     #+NAME: exercise-1-37-iter
     #+begin_src scheme
       (define (cont-frac-iter n d k)
         (define (iter i result)
           (if (= i 0)
               result
               (iter (- i 1)
                     (/ (n i) (+ (d i) result)))))
         (iter k 0))
     #+end_src

     #+header: :exports both
     #+begin_src scheme
       <<common>>
       <<exercise-1-37-recur>>
       (map (lambda (k)
              (p (cont-frac (lambda (i) 1.0)
                            (lambda (i) 1.0)
                            k)))
            '(5 10 15 20 30))
       <<exercise-1-37-iter>>
       (map (lambda (k)
              (p (cont-frac (lambda (i) 1.0)
                            (lambda (i) 1.0)
                            k)))
            '(5 10 15 20 30))
     #+end_src

     #+RESULTS:
     #+begin_example

     0.625
     0.6179775280898876
     0.6180344478216819
     0.6180339850173578
     0.6180339887496482
     0.625
     0.6179775280898876
     0.6180344478216819
     0.6180339850173578
     0.6180339887496482
     #+end_example

**** Exercise 2.6
     <<Exercise 2.6>>
     #+PINDEX: 2.06 Church numerals

     In case representing pairs as procedures wasn’t mind-boggling enough, consider that, in a language that can manipulate procedures, we can get by without numbers (at least insofar as nonnegative integers are concerned) by implementing 0 and the operation of adding 1 as

     #+CAPTION: exercise-2-6-q
     #+NAME: exercise-2-6-q
     #+begin_src scheme
       (define zero (lambda (f) (lambda (x) x)))

       (define (add-1 n)
         (lambda (f) (lambda (x) (f ((n f) x)))))
     #+end_src

     This representation is known as /Church numerals/, after its inventor, Alonzo Church, the logician who invented the λ-calculus.

     Define ~one~ and ~two~ directly (not in terms of ~zero~ and ~add-1~). (Hint: Use substitution to evaluate ~(add-1 zero)~). Give a direct definition of the addition procedure ~+~ (not in terms of repeated application of ~add-1~).

     *Solution*

     #+CAPTION: exercise-2-6
     #+NAME: exercise-2-6
     #+begin_src scheme
       ;; (add-1 zero)
       ;; (lambda (f) (lambda (x) (f ((zero f) x))))
       ;; (lambda (f) (lambda (x) (f x)))
       (define one (lambda (f) (lambda (x) (f x))))

       ;; (add-1 one)
       ;; (lambda (f) (lambda (x) (f ((one f) x))))
       ;; (lambda (f) (lambda (x) (f (f x))))
       (define two (lambda (f) (lambda (x) (f (f x)))))

       (define (+ a b)
         (lambda (f) (lambda (x) ((b f) ((a f) x)))))
     #+end_src

     #+header: :exports both
     #+begin_src scheme
       <<common>>
       <<exercise-2-6-q>>
       <<exercise-2-6>>
       (p "--zero--")
       ((zero p) 'hello)
       (p "--one--")
       ((one p) 'hello)
       (p "--two--")
       ((two p) 'hello)
       (p "--three--")
       (((+ one two) p) 'hello)
     #+end_src

     #+RESULTS:
     #+begin_example

     --zero--
     --one--
     hello
     --two--
     hello
     hello
     --three--
     hello
     hello
     hello
     #+end_example

**** Exercise 2.9
     <<Exercise 2.9>>
     #+PINDEX: 2.09 width

     The /width/ of an interval is half of the difference between its upper and lower bounds. The width is a measure of the uncertainty of the number specified by the interval. For some arithmetic operations the width of the result of combining two intervals is a function only of the widths of the argument intervals, whereas for others the width of the combination is not a function of the widths of the argument intervals. Show that the width of the sum (or difference) of two intervals is a function only of the widths of the intervals being added (or subtracted). Give examples to show that this is not true for multiplication or division.

     *Solution*

     #+CAPTION: exercise-2-9
     #+NAME: exercise-2-9
     #+begin_src scheme
       (define (width x)
         (/ (- (upper-bound x)
               (lower-bound x))
            2.0))
     #+end_src

     #+header: :exports both
     #+begin_src scheme
       <<common>>
       <<interval>>
       <<exercise-2-7>>
       <<exercise-2-8>>
       <<exercise-2-9>>
       (define a (make-interval 1 5))
       (define b (make-interval 2 9))
       (display "width of a: ")
       (display (width a))
       (p "width of b: ")
       (display (width b))
       (p "width of a+b: ")
       (display (width (add-interval a b)))
       (p "width of a-b: ")
       (display (width (sub-interval a b)))
       (p "width of a*b: ")
       (display (width (mul-interval a b)))
       (p "width of a/b: ")
       (display (width (div-interval a b)))
     #+end_src

     #+RESULTS:
     : width of a: 2.0
     : width of b: 3.5
     : width of a+b: 5.5
     : width of a-b: 5.5
     : width of a*b: 21.5
     : width of a/b: 1.1944444444444444

     We can draw conclusions about addition and subtraction
     \[ \operatorname{width}(a \pm b) = \operatorname{width}(a) + \operatorname{width}(b). \]

**** Exercise 2.10
     <<Exercise 2.10>>
     #+PINDEX: 2.10 div denominator check

     Ben Bitdiddle, an expert systems programmer, looks over Alyssa’s shoulder and comments that it is not clear what it means to divide by an interval that spans zero. Modify Alyssa’s code to check for this condition and to signal an error if it occurs.

    *Solution*

    #+CAPTION: exercise-2-10
    #+NAME: exercise-2-10
    #+begin_src scheme
      (define (div-interval x y)
        (if (<= (* (upper-bound y)
                   (lower-bound y))
                0)
            (error "divide by an interval that spans zero")
            (mul-interval x
                          (make-interval
                           (/ 1.0 (upper-bound y))
                           (/ 1.0 (lower-bound y))))))
    #+end_src

    #+header: :exports both
    #+begin_src scheme
      <<common>>
      <<interval>>
      <<exercise-2-7>>
      <<exercise-2-8>>
      <<exercise-2-10>>
      (div-interval (make-interval 2 9)
                    (make-interval -1 2))
    #+end_src

    #+RESULTS:
    : ice-9/boot-9.scm:1669:16: In procedure raise-exception:
    : divide by an interval that spans zero
    :
    : Entering a new prompt.  Type `,bt' for a backtrace or `,q' to continue.
    : scheme@(guile-user) [1]>

**** Exercise 2.33
     <<Exercise 2.33>>
     #+PINDEX: 2.33 list-manipulation operations as accumulations

     Fill in the missing expressions to complete the following definitions of some basic list-manipulation operations as accumulations:

     #+begin_src scheme
       (define (map p sequence)
         (accumulate (lambda (x y) ⟨??⟩)
                     nil sequence))

       (define (append seq1 seq2)
         (accumulate cons ⟨??⟩ ⟨??⟩))

       (define (length sequence)
         (accumulate ⟨??⟩ 0 sequence))
     #+end_src

     *Solution*

     #+CAPTION: exercise-2-33
     #+NAME: exercise-2-33
     #+begin_src scheme
       (define (map p sequence)
         (accumulate (lambda (x y) (p x))
                     nil sequence))

       (define (append seq1 seq2)
         (accumulate cons seq2 seq1))

       (define (length sequence)
         (accumulate (lambda (x y) (+ 1 y)) 0 sequence))
     #+end_src

     #+begin_src scheme
       <<common>>
       <<list>>
       <<sequence-operations>>
       <<exercise-2-33>>
       (map display '(1 2 3))
       (p (append '(1 2 3) '(4 5 6)))
       (p (length '(1 2 3)))
     #+end_src

     #+RESULTS:
     : 321
     : (1 2 3 4 5 6)
     : 3

